# В таблице ниже содержится информация о доходах (income) и расходах (outcome) компании за два года. Напишите
# SQL-запрос, который выведет четыре столбца: month — номер месяца, in2020 — доходы за каждый месяц 2020 года,
# in2021 — доходы за каждый месяц 2021 года и diff разницу ежемесячных доходов между 2021 и 2020 годом.

-- init
DROP TABLE IF EXISTS revenues;
CREATE TABLE revenues (
    year INTEGER NULL,
    month INTEGER NULL,
    income INTEGER NULL,
    outcome INTEGER NULL
);
INSERT INTO revenues (year, month, income, outcome)
VALUES
    (2020, 1, 0, 150000),
    (2020, 2, 0, 150000),
    (2020, 3, 0, 150000),
    (2020, 4, 50000, 170000),
    (2020, 5, 60000, 170000),
    (2020, 6, 80000, 180000),
    (2020, 7, 100000, 180000),
    (2020, 8, 120000, 180000),
    (2020, 9, 150000, 180000),
    (2020, 10, 200000, 200000),
    (2020, 11, 250000, 210000),
    (2020, 12, 250000, 210000),
    (2021, 1, 300000, 210000),
    (2021, 2, 320000, 220000),
    (2021, 3, 350000, 250000),
    (2021, 4, 350000, 260000),
    (2021, 5, 380000, 280000),
    (2021, 6, 400000, 290000),
    (2021, 7, 450000, 250000),
    (2021, 8, 460000, 250000),
    (2021, 9, 470000, 200000),
    (2021, 10, 450000, 200000),
    (2021, 11, 480000, 210000),
    (2021, 12, 480000, 190000);

-- solution
SELECT
    quarter,
    SUM(in2020) AS in2020,
    SUM(in2021) AS in2021,
    SUM(diff) AS diff
FROM
    (SELECT
        CEILING(month / 3) as quarter,
        LAG(income, 12) OVER() AS in2020,
        income AS in2021,
        income -LAG(income, 12) OVER() AS diff
    FROM revenues
    LIMIT 12
    OFFSET 12) as temp
GROUP BY quarter